//Выражения
"Фрагмент кода, в котором создаётся значение, называется выражением."
"Каждое значение, написанное буквально(22 или 'hello world'), является выражением."
"Выражения могут содержать в себе другие выражения, подобно предложениям человеческого языка:"
"сложное предложение включает в себя простые и т.д."
"Это позволяет создавать выражения, которые описывают сколь угодно сложные вычисления."

//Инструкции
"Если выражение соответствует фрагменту предложения, то инструкция JS соответствует полному предложению."
"Программа представляет собой последовательность инструкций."
"Простейший вид инструкции - это инструкция, после которой стоит точка с запятой. Вот программа:"

1;
true;

"Однако это бесполезная программа! Выражение может просто создавать значение, но инструкция же саможостаточна."
"Она чего-то стоит, только если влияет на мир."
"ИНстуркция может выводить что-то на экран. Это считатется изменением мира. Или влиять на следуюший инстуркии - побочные эффекты."
"Операторы в предыдущем примере просто создают значения 1 и true, а затем сразу отбрасывает их. Это никак не влияет на окружающий мир."