//Окружение

"Множество переменных и их значений, которые существуют в данный момент времени, называются окружением."
"При запуске программы это окружение не является пустым. Оно всегда содержит переменные, выступающие частью языкового стандарта."
"А также, в большинстве случаев, переменные, которые обеспечивают способы взаимодействия с окружающей системой."
"Например, в браузере есть функции для взаимодействия с загруженным в данный момент сайтом для чтения информации."

//Функции 

"Многие значения, представляемые в окружении по умолчанию, имеют function."
"Функция - это часть программы, обёрнутая в значение."
"Такие значения могут применяться для выполнения обёрнутой функции."
"Например, переменная prompt содержит функцию в окружении браузера."

"Выполнение функции называется её вызовом или применением."
"Чтобы вызвать функцию, можно также поставить скобки после выражения, которое производит значение функции."
