"Не каждая программа представляет собой прямую дорогу. Например, мы может создать перекрёсток,"
"на котором программа будет выбирать нужный путь в зависимости от ситуации."
"Это называется УСЛОВНЫМ ОПЕРАТОРОМ"

"В JS условное выполнение создаётся при помощи ключевого слова if."

/*
let number = Number(prompt("Введите число"));
if(!Number.isNaN(number)){
    console.log("Это число");
}else{
    console.log("Это не число");
}
*/

"Ключевое слово if выполняет или не выполняет инструкцию в зависимости от значения логического выражения."

if (1 + 1 == 2) console.log("NO WAY"); //NO WAY


