"Основная идея объектно-ориентированного программирования состоит в том, чтобы"
"разделить программу на более мелкие части и сделать так, чтобы каждая из них отвечала"
"за управление своим состоянием."

"Таким образом, некоторые знания о том, как работает данная часть программы, могут храниться в ней локально."
"Те, кто работает над остальной частью программы, не должны помнить или даже иметь представление об этих знаниях."
"Всякий раз, когда локальные детали изменяются, должен обновляться только код, непосредственно имеющий к ним отношение."

"Части такой программы взаимодействуют между собой посредством интерфейсов - ограниченных наборов функций - или привязок,"
"которые представляют полезную функциональность на более абстрактном уровне, скрывая подробности реализации."

"Такие программы моделируются с использованием объектов."
"Их интерфейс представляет собой определённый набор методов и свойств."
"Свойства, являющиеся частью интерфейса, называются общедоступными."
"Другие, которые не должны быть доступны для внешнего кода, называются закрытыми."

"Отделение интерфейса от реализации - отличная идея. Обычно это называется инкапсуляцией."

"Инкапсуляция — это один из основных принципов объектно-ориентированного программирования (ООП), "
"который позволяет объединять данные и методы (функции) внутри объекта, скрывая их от прямого доступа извне. "
"Таким образом, инкапсуляция обеспечивает контроль над доступом к данным и методам объекта."