"Недавно мы познакомились с объектами в JavaScript."
"В культуре программирования есть раздел, называемый ОБЪЕКТНО-ОРИЕНТИРОВАННЫМ ПРОГРАММИРОВАНИЕМ, -"
"это набор техник, для которых объекты (и связанные с ними понятия) являются центральным приниципом организации программы."
"Объектно-ориентированное программирование стало основой для многих языков программирования, включая JS."

"Объе́ктно-ориенти́рованное программирование — методология программирования,"
"основанная на представлении программы в виде совокупности объектов,"
"каждый из которых является экземпляром определённого класса, а классы образуют иерархию наследования."

