"Дан массив:"
/*
[
	[
		[11, 12, 13],
		[14, 15, 16],
		[17, 17, 19],
	],
	[
		[21, 22, 23],
		[24, 25, 26],
		[27, 27, 29],
	],
	[
		[31, 32, 33],
		[34, 35, 36],
		[37, 37, 39],
	],
]
*/
"Найдите сумму элементов этого массива."


function sumMatrix(matrix){
    let sm = 0;
    for(array of matrix){
        for(elem of array){
            sm += elem.reduce((a, b) => a + b, 0);
        }
    }
    return sm;
}

console.log(sumMatrix([
	[
		[11, 12, 13],
		[14, 15, 16],
		[17, 17, 19],
	],
	[
		[21, 22, 23],
		[24, 25, 26],
		[27, 27, 29],
	],
	[
		[31, 32, 33],
		[34, 35, 36],
		[37, 37, 39],
	],
])) //672