"Дано число. Получите массив делителей этого числа."

function getDividers(n){
    let i = 1, arr = [];
    while(i * i <= n){
        if(n % i == 0){
            arr.push(i);
            if(n / i != i) arr.push(n / i);
        }
        i++
    }
    return arr.sort((a, b) => a - b);
}

console.log(getDividers(12332132))
/*
[
        1,       2,        4,
       71,     142,      173,
      251,     284,      346,
      502,     692,     1004,
    12283,   17821,    24566,
    35642,   43423,    49132,
    71284,   86846,   173692,
  3083033, 6166066, 12332132
]
*/